Tekla Open API Reference for Tekla Structures 2025
Assembly.Add Method (Assembly)
 Adds a new subassembly for the assembly instance.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Add(
	Assembly Assembly
)
Public Function Add (
	Assembly As Assembly
) As Boolean
Parameters
Assembly
Type: Tekla.Structures.Model.Assembly
The assembly instance to be added.
Return Value
Type: Boolean
True if the subassembly was successfully added.
See Also
Reference
Assembly Class
Add Overload
Tekla.Structures.Model Namespace